nc: 1
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [ -1, 1, Conv,  [ 64, 3, 2 ] ]
  - [ -1, 1, Conv,  [ 128, 3, 2 ] ]
  - [ -1, 1, Conv,  [ 256, 3, 2 ] ]
  - [ -1, 1, Conv,  [ 512, 3, 2 ] ]
  - [ -1, 1, DHFE,  [ 512 ] ]
  - [ -1, 1, Conv,  [ 1024, 3, 2 ] ]
  - [ -1, 1, MS-RFAM,  [ 1024 ] ]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 1, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 1, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 1, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, RepC3, [256]]

  - [[18, 21, 24], 1, RTDETRDecoder, [nc]]